RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_usb.h
/* Bit fields for USB IF */
#define _USB_IF_RESETVALUE                         0x00000000UL                    /**< Default value for USB_IF */
#define _USB_IF_MASK                               0x00000F03UL                    /**< Mask for USB_IF */
#define USB_IF_VBUSDETH                            (0x1UL << 0)                    /**< VBUS Detect High Interrupt Flag */
#define _USB_IF_VBUSDETH_SHIFT                     0                               /**< Shift value for USB_VBUSDETH */
#define _USB_IF_VBUSDETH_MASK                      0x1UL                           /**< Bit mask for USB_VBUSDETH */
#define _USB_IF_VBUSDETH_DEFAULT                   0x00000000UL                    /**< Mode DEFAULT for USB_IF */
#define USB_IF_VBUSDETH_DEFAULT                    (_USB_IF_VBUSDETH_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_IF */
#define USB_IF_VBUSDETL                            (0x1UL << 1)                    /**< VBUS Detect Low Interrupt Flag */
#define _USB_IF_VBUSDETL_SHIFT                     1                               /**< Shift value for USB_VBUSDETL */
#define _USB_IF_VBUSDETL_MASK                      0x2UL                           /**< Bit mask for USB_VBUSDETL */
#define _USB_IF_VBUSDETL_DEFAULT                   0x00000000UL                    /**< Mode DEFAULT for USB_IF */
#define USB_IF_VBUSDETL_DEFAULT                    (_USB_IF_VBUSDETL_DEFAULT << 1) /**< Shifted mode DEFAULT for USB_IF */
#define USB_IF_ERR                                 (0x1UL << 8)                    /**< Detection Error Interrupt Flag */
#define _USB_IF_ERR_SHIFT                          8                               /**< Shift value for USB_ERR */
#define _USB_IF_ERR_MASK                           0x100UL                         /**< Bit mask for USB_ERR */
#define _USB_IF_ERR_DEFAULT                        0x00000000UL                    /**< Mode DEFAULT for USB_IF */
#define USB_IF_ERR_DEFAULT                         (_USB_IF_ERR_DEFAULT << 8)      /**< Shifted mode DEFAULT for USB_IF */
#define USB_IF_DCD                                 (0x1UL << 9)                    /**< Data Contact Detection Complete Interrupt Flag */
#define _USB_IF_DCD_SHIFT                          9                               /**< Shift value for USB_DCD */
#define _USB_IF_DCD_MASK                           0x200UL                         /**< Bit mask for USB_DCD */
#define _USB_IF_DCD_DEFAULT                        0x00000000UL                    /**< Mode DEFAULT for USB_IF */
#define USB_IF_DCD_DEFAULT                         (_USB_IF_DCD_DEFAULT << 9)      /**< Shifted mode DEFAULT for USB_IF */
#define USB_IF_PD                                  (0x1UL << 10)                   /**< Primary Detection Complete Interrupt Flag */
#define _USB_IF_PD_SHIFT                           10                              /**< Shift value for USB_PD */
#define _USB_IF_PD_MASK                            0x400UL                         /**< Bit mask for USB_PD */
#define _USB_IF_PD_DEFAULT                         0x00000000UL                    /**< Mode DEFAULT for USB_IF */
#define USB_IF_PD_DEFAULT                          (_USB_IF_PD_DEFAULT << 10)      /**< Shifted mode DEFAULT for USB_IF */
#define USB_IF_SD                                  (0x1UL << 11)                   /**< Secondary Detection Complete Interrupt Flag */
#define _USB_IF_SD_SHIFT                           11                              /**< Shift value for USB_SD */
#define _USB_IF_SD_MASK                            0x800UL                         /**< Bit mask for USB_SD */
#define _USB_IF_SD_DEFAULT                         0x00000000UL                    /**< Mode DEFAULT for USB_IF */
#define USB_IF_SD_DEFAULT                          (_USB_IF_SD_DEFAULT << 11)      /**< Shifted mode DEFAULT for USB_IF */

/* Bit fields for USB IFS */
#define _USB_IFS_RESETVALUE                        0x00000000UL                     /**< Default value for USB_IFS */
#define _USB_IFS_MASK                              0x00000F03UL                     /**< Mask for USB_IFS */
#define USB_IFS_VBUSDETH                           (0x1UL << 0)                     /**< Set VBUSDETH Interrupt Flag */
#define _USB_IFS_VBUSDETH_SHIFT                    0                                /**< Shift value for USB_VBUSDETH */
#define _USB_IFS_VBUSDETH_MASK                     0x1UL                            /**< Bit mask for USB_VBUSDETH */
#define _USB_IFS_VBUSDETH_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for USB_IFS */
#define USB_IFS_VBUSDETH_DEFAULT                   (_USB_IFS_VBUSDETH_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_IFS */
#define USB_IFS_VBUSDETL                           (0x1UL << 1)                     /**< Set VBUSDETL Interrupt Flag */
#define _USB_IFS_VBUSDETL_SHIFT                    1                                /**< Shift value for USB_VBUSDETL */
#define _USB_IFS_VBUSDETL_MASK                     0x2UL                            /**< Bit mask for USB_VBUSDETL */
#define _USB_IFS_VBUSDETL_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for USB_IFS */
#define USB_IFS_VBUSDETL_DEFAULT                   (_USB_IFS_VBUSDETL_DEFAULT << 1) /**< Shifted mode DEFAULT for USB_IFS */
#define USB_IFS_ERR                                (0x1UL << 8)                     /**< Set ERR Interrupt Flag */
#define _USB_IFS_ERR_SHIFT                         8                                /**< Shift value for USB_ERR */
#define _USB_IFS_ERR_MASK                          0x100UL                          /**< Bit mask for USB_ERR */
#define _USB_IFS_ERR_DEFAULT                       0x00000000UL                     /**< Mode DEFAULT for USB_IFS */
#define USB_IFS_ERR_DEFAULT                        (_USB_IFS_ERR_DEFAULT << 8)      /**< Shifted mode DEFAULT for USB_IFS */
#define USB_IFS_DCD                                (0x1UL << 9)                     /**< Set DCD Interrupt Flag */
#define _USB_IFS_DCD_SHIFT                         9                                /**< Shift value for USB_DCD */
#define _USB_IFS_DCD_MASK                          0x200UL                          /**< Bit mask for USB_DCD */
#define _USB_IFS_DCD_DEFAULT                       0x00000000UL                     /**< Mode DEFAULT for USB_IFS */
#define USB_IFS_DCD_DEFAULT                        (_USB_IFS_DCD_DEFAULT << 9)      /**< Shifted mode DEFAULT for USB_IFS */
#define USB_IFS_PD                                 (0x1UL << 10)                    /**< Set PD Interrupt Flag */
#define _USB_IFS_PD_SHIFT                          10                               /**< Shift value for USB_PD */
#define _USB_IFS_PD_MASK                           0x400UL                          /**< Bit mask for USB_PD */
#define _USB_IFS_PD_DEFAULT                        0x00000000UL                     /**< Mode DEFAULT for USB_IFS */
#define USB_IFS_PD_DEFAULT                         (_USB_IFS_PD_DEFAULT << 10)      /**< Shifted mode DEFAULT for USB_IFS */
#define USB_IFS_SD                                 (0x1UL << 11)                    /**< Set SD Interrupt Flag */
#define _USB_IFS_SD_SHIFT                          11                               /**< Shift value for USB_SD */
#define _USB_IFS_SD_MASK                           0x800UL                          /**< Bit mask for USB_SD */
#define _USB_IFS_SD_DEFAULT                        0x00000000UL                     /**< Mode DEFAULT for USB_IFS */
#define USB_IFS_SD_DEFAULT                         (_USB_IFS_SD_DEFAULT << 11)      /**< Shifted mode DEFAULT for USB_IFS */

/* Bit fields for USB IFC */
#define _USB_IFC_RESETVALUE                        0x00000000UL                     /**< Default value for USB_IFC */
#define _USB_IFC_MASK                              0x00000F03UL                     /**< Mask for USB_IFC */
#define USB_IFC_VBUSDETH                           (0x1UL << 0)                     /**< Clear VBUSDETH Interrupt Flag */
#define _USB_IFC_VBUSDETH_SHIFT                    0                                /**< Shift value for USB_VBUSDETH */
#define _USB_IFC_VBUSDETH_MASK                     0x1UL                            /**< Bit mask for USB_VBUSDETH */
#define _USB_IFC_VBUSDETH_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for USB_IFC */
#define USB_IFC_VBUSDETH_DEFAULT                   (_USB_IFC_VBUSDETH_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_IFC */
#define USB_IFC_VBUSDETL                           (0x1UL << 1)                     /**< Clear VBUSDETL Interrupt Flag */
#define _USB_IFC_VBUSDETL_SHIFT                    1                                /**< Shift value for USB_VBUSDETL */
#define _USB_IFC_VBUSDETL_MASK                     0x2UL                            /**< Bit mask for USB_VBUSDETL */
#define _USB_IFC_VBUSDETL_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for USB_IFC */
#define USB_IFC_VBUSDETL_DEFAULT                   (_USB_IFC_VBUSDETL_DEFAULT << 1) /**< Shifted mode DEFAULT for USB_IFC */
#define USB_IFC_ERR                                (0x1UL << 8)                     /**< Clear ERR Interrupt Flag */
#define _USB_IFC_ERR_SHIFT                         8                                /**< Shift value for USB_ERR */
#define _USB_IFC_ERR_MASK                          0x100UL                          /**< Bit mask for USB_ERR */
#define _USB_IFC_ERR_DEFAULT                       0x00000000UL                     /**< Mode DEFAULT for USB_IFC */
#define USB_IFC_ERR_DEFAULT                        (_USB_IFC_ERR_DEFAULT << 8)      /**< Shifted mode DEFAULT for USB_IFC */
#define USB_IFC_DCD                                (0x1UL << 9)                     /**< Clear DCD Interrupt Flag */
#define _USB_IFC_DCD_SHIFT                         9                                /**< Shift value for USB_DCD */
#define _USB_IFC_DCD_MASK                          0x200UL                          /**< Bit mask for USB_DCD */
#define _USB_IFC_DCD_DEFAULT                       0x00000000UL                     /**< Mode DEFAULT for USB_IFC */
#define USB_IFC_DCD_DEFAULT                        (_USB_IFC_DCD_DEFAULT << 9)      /**< Shifted mode DEFAULT for USB_IFC */
#define USB_IFC_PD                                 (0x1UL << 10)                    /**< Clear PD Interrupt Flag */
#define _USB_IFC_PD_SHIFT                          10                               /**< Shift value for USB_PD */
#define _USB_IFC_PD_MASK                           0x400UL                          /**< Bit mask for USB_PD */
#define _USB_IFC_PD_DEFAULT                        0x00000000UL                     /**< Mode DEFAULT for USB_IFC */
#define USB_IFC_PD_DEFAULT                         (_USB_IFC_PD_DEFAULT << 10)      /**< Shifted mode DEFAULT for USB_IFC */
#define USB_IFC_SD                                 (0x1UL << 11)                    /**< Clear SD Interrupt Flag */
#define _USB_IFC_SD_SHIFT                          11                               /**< Shift value for USB_SD */
#define _USB_IFC_SD_MASK                           0x800UL                          /**< Bit mask for USB_SD */
#define _USB_IFC_SD_DEFAULT                        0x00000000UL                     /**< Mode DEFAULT for USB_IFC */
#define USB_IFC_SD_DEFAULT                         (_USB_IFC_SD_DEFAULT << 11)      /**< Shifted mode DEFAULT for USB_IFC */

