RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_usb.h
/* Bit fields for USB IEN */
#define _USB_IEN_RESETVALUE                        0x00000000UL                     /**< Default value for USB_IEN */
#define _USB_IEN_MASK                              0x00000F03UL                     /**< Mask for USB_IEN */
#define USB_IEN_VBUSDETH                           (0x1UL << 0)                     /**< VBUSDETH Interrupt Enable */
#define _USB_IEN_VBUSDETH_SHIFT                    0                                /**< Shift value for USB_VBUSDETH */
#define _USB_IEN_VBUSDETH_MASK                     0x1UL                            /**< Bit mask for USB_VBUSDETH */
#define _USB_IEN_VBUSDETH_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for USB_IEN */
#define USB_IEN_VBUSDETH_DEFAULT                   (_USB_IEN_VBUSDETH_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_IEN */
#define USB_IEN_VBUSDETL                           (0x1UL << 1)                     /**< VBUSDETL Interrupt Enable */
#define _USB_IEN_VBUSDETL_SHIFT                    1                                /**< Shift value for USB_VBUSDETL */
#define _USB_IEN_VBUSDETL_MASK                     0x2UL                            /**< Bit mask for USB_VBUSDETL */
#define _USB_IEN_VBUSDETL_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for USB_IEN */
#define USB_IEN_VBUSDETL_DEFAULT                   (_USB_IEN_VBUSDETL_DEFAULT << 1) /**< Shifted mode DEFAULT for USB_IEN */
#define USB_IEN_ERR                                (0x1UL << 8)                     /**< ERR Interrupt Enable */
#define _USB_IEN_ERR_SHIFT                         8                                /**< Shift value for USB_ERR */
#define _USB_IEN_ERR_MASK                          0x100UL                          /**< Bit mask for USB_ERR */
#define _USB_IEN_ERR_DEFAULT                       0x00000000UL                     /**< Mode DEFAULT for USB_IEN */
#define USB_IEN_ERR_DEFAULT                        (_USB_IEN_ERR_DEFAULT << 8)      /**< Shifted mode DEFAULT for USB_IEN */
#define USB_IEN_DCD                                (0x1UL << 9)                     /**< DCD Interrupt Enable */
#define _USB_IEN_DCD_SHIFT                         9                                /**< Shift value for USB_DCD */
#define _USB_IEN_DCD_MASK                          0x200UL                          /**< Bit mask for USB_DCD */
#define _USB_IEN_DCD_DEFAULT                       0x00000000UL                     /**< Mode DEFAULT for USB_IEN */
#define USB_IEN_DCD_DEFAULT                        (_USB_IEN_DCD_DEFAULT << 9)      /**< Shifted mode DEFAULT for USB_IEN */
#define USB_IEN_PD                                 (0x1UL << 10)                    /**< PD Interrupt Enable */
#define _USB_IEN_PD_SHIFT                          10                               /**< Shift value for USB_PD */
#define _USB_IEN_PD_MASK                           0x400UL                          /**< Bit mask for USB_PD */
#define _USB_IEN_PD_DEFAULT                        0x00000000UL                     /**< Mode DEFAULT for USB_IEN */
#define USB_IEN_PD_DEFAULT                         (_USB_IEN_PD_DEFAULT << 10)      /**< Shifted mode DEFAULT for USB_IEN */
#define USB_IEN_SD                                 (0x1UL << 11)                    /**< SD Interrupt Enable */
#define _USB_IEN_SD_SHIFT                          11                               /**< Shift value for USB_SD */
#define _USB_IEN_SD_MASK                           0x800UL                          /**< Bit mask for USB_SD */
#define _USB_IEN_SD_DEFAULT                        0x00000000UL                     /**< Mode DEFAULT for USB_IEN */
#define USB_IEN_SD_DEFAULT                         (_USB_IEN_SD_DEFAULT << 11)      /**< Shifted mode DEFAULT for USB_IEN */

/* Bit fields for USB ROUTE */
#define _USB_ROUTE_RESETVALUE                      0x00000000UL                        /**< Default value for USB_ROUTE */
#define _USB_ROUTE_MASK                            0x00000003UL                        /**< Mask for USB_ROUTE */
#define USB_ROUTE_PHYPEN                           (0x1UL << 0)                        /**< USB PHY Pin Enable */
#define _USB_ROUTE_PHYPEN_SHIFT                    0                                   /**< Shift value for USB_PHYPEN */
#define _USB_ROUTE_PHYPEN_MASK                     0x1UL                               /**< Bit mask for USB_PHYPEN */
#define _USB_ROUTE_PHYPEN_DEFAULT                  0x00000000UL                        /**< Mode DEFAULT for USB_ROUTE */
#define USB_ROUTE_PHYPEN_DEFAULT                   (_USB_ROUTE_PHYPEN_DEFAULT << 0)    /**< Shifted mode DEFAULT for USB_ROUTE */
#define USB_ROUTE_VBUSENPEN                        (0x1UL << 1)                        /**< VBUSEN Pin Enable */
#define _USB_ROUTE_VBUSENPEN_SHIFT                 1                                   /**< Shift value for USB_VBUSENPEN */
#define _USB_ROUTE_VBUSENPEN_MASK                  0x2UL                               /**< Bit mask for USB_VBUSENPEN */
#define _USB_ROUTE_VBUSENPEN_DEFAULT               0x00000000UL                        /**< Mode DEFAULT for USB_ROUTE */
#define USB_ROUTE_VBUSENPEN_DEFAULT                (_USB_ROUTE_VBUSENPEN_DEFAULT << 1) /**< Shifted mode DEFAULT for USB_ROUTE */

/* Bit fields for USB CDCONF */
#define _USB_CDCONF_RESETVALUE                     0x00000000UL                         /**< Default value for USB_CDCONF */
#define _USB_CDCONF_MASK                           0x000003FFUL                         /**< Mask for USB_CDCONF */
#define _USB_CDCONF_DCDTOCONF_SHIFT                0                                    /**< Shift value for USB_DCDTOCONF */
#define _USB_CDCONF_DCDTOCONF_MASK                 0x3FFUL                              /**< Bit mask for USB_DCDTOCONF */
#define _USB_CDCONF_DCDTOCONF_DEFAULT              0x00000000UL                         /**< Mode DEFAULT for USB_CDCONF */
#define USB_CDCONF_DCDTOCONF_DEFAULT               (_USB_CDCONF_DCDTOCONF_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_CDCONF */

/* Bit fields for USB CMD */
#define _USB_CMD_RESETVALUE                        0x00000000UL                    /**< Default value for USB_CMD */
#define _USB_CMD_MASK                              0x00000003UL                    /**< Mask for USB_CMD */
#define USB_CMD_STARTCD                            (0x1UL << 0)                    /**< Start Charger Detection Enabled */
#define _USB_CMD_STARTCD_SHIFT                     0                               /**< Shift value for USB_STARTCD */
#define _USB_CMD_STARTCD_MASK                      0x1UL                           /**< Bit mask for USB_STARTCD */
#define _USB_CMD_STARTCD_DEFAULT                   0x00000000UL                    /**< Mode DEFAULT for USB_CMD */
#define USB_CMD_STARTCD_DEFAULT                    (_USB_CMD_STARTCD_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_CMD */
#define USB_CMD_STOPCD                             (0x1UL << 1)                    /**< Start Charger Detection in Progress */
#define _USB_CMD_STOPCD_SHIFT                      1                               /**< Shift value for USB_STOPCD */
#define _USB_CMD_STOPCD_MASK                       0x2UL                           /**< Bit mask for USB_STOPCD */
#define _USB_CMD_STOPCD_DEFAULT                    0x00000000UL                    /**< Mode DEFAULT for USB_CMD */
#define USB_CMD_STOPCD_DEFAULT                     (_USB_CMD_STOPCD_DEFAULT << 1)  /**< Shifted mode DEFAULT for USB_CMD */

